---
kind: type
id: T:Autodesk.Revit.DB.FittingAngleUsage
source: html/aac7ada1-a94c-8f2c-39b9-570f1f0825c8.htm
---
# Autodesk.Revit.DB.FittingAngleUsage

An enumerated type representing the options for how to limit the angle values applicable to fitting content.

## Syntax (C#)
```csharp
public enum FittingAngleUsage
```